import math
from pickletools import read_long1

# Задание № 1
print("Задание № 1")
a = 20
b = 30
x = 60
y = (a ** 2 / 3) + ((a ** 2 + 4) / b) + ((math.sqrt(a ** 2 + 4)) / 4) + ((math.sqrt((a ** 2 + 4) ** 3)) / 4)
print(f"Из формулы a - y = {y}")
y_1 = math.cos(x) + math.sin(x)
print(f"Из формулы b - y = {y_1}")
y_2 = (((math.cos(x ** 2)) ** 2) + (math.sin(2 * x - 1)) ** 2 ) ** (1 / 3)
print(f"Из формулы c - y = {y_2}")
y_3 = 5 * x + 3 * x ** 2 * math.sqrt(1 + (math.sin(x)) ** 2)
print(f"Из формулы d - y = {y_3}")
print()

# Задание № 2
print("Задание № 2")
i = p = 0.1
s = 11000
n = 12
m = (s * p * (1 + p) ** n) / ((1 + p) ** n) - 1
m_1 = m * n
m_2 = m_1 - s
print(f"Процентная ставка = {i}")
print(f"Сумма займа = {s}")
print(f"Кол-во месяцев = {n}")
print(f"Сумма ежемесячной выплаты = {m}")
print(f"Общая сумма выплаты = {m_1}")
print(f"Переплата = {m_2}")
print()

# Задание № 3
print("Задание № 3")
r_1 = 12200
r_2 = 48400
v_1 = 3600
v_2 = 1800
l_1 = (2 * r_1 * math.pi) / v_1
l_2 = (2 * r_2 * math.pi) / v_2
print(f"Длина года первой планеты = {l_1} часов")
print(f"Длина года второй планеты = {l_2} часов")
if l_1 > l_2:
    print("Год на первой планете длиннее чем на второй")
elif l_2 > l_1:
    print("Год на второй планете длиннее чем на первой")
else:
    print("Длинна года на обеих планетах равны")